app/views/messages/_message.html.erb

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["room_id", 2], ["body", "sssssssss"], ["created_at", "2022-08-31 07:35:35.394516"], ["updated_at", "2022-08-31 07:35:35.394516"]]
---
        <h6 class="name"> <%= message.user.username %></h6>
        <p class="time"><%= time_ago_in_words(message.created_at) %> ago</p>