app/controllers/messages_controller.rb

  def create
    @message = current_user.messages.create(
      body: msg_params[:body],
      room_id: params[:room_id],
      attachments: msg_params[:attachments]
    )
---
INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 7], ["room_id", 2], ["body", ""], ["created_at", "2022-10-05 08:13:37.442698"], ["updated_at", "2022-10-05 08:13:37.442698"]]