app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" ASC  [["room_id", 2]]
---
  def show
    @single_room = Room.find(params[:id])

    @room = Room.new
    @rooms = Room.public_rooms

    @message = Message.new
    @messages = @single_room.messages.order(created_at: :asc)

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", " "], ["is_private", false], ["created_at", "2022-08-31 10:19:13.742419"], ["updated_at", "2022-08-31 10:19:13.742419"]]
---
  def create
    @room = Room.create(name: params["room"]["name"])