app/controllers/users_controller.rb

  def show
    @users = User.all_except(current_user)

    @room = Room.new
    @rooms = Room.public_rooms
    @room_name = get_name(@user,current_user)
    @single_room = Room.where(name: @room_name).first || Room.create_private_room([@user, current_user], @room_name)

    @message = Message.new
    @messages = @single_room.messages.order(created_at: :asc)
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_2_5"], ["is_private", true], ["created_at", "2022-08-31 13:43:03.212471"], ["updated_at", "2022-08-31 13:43:03.212471"]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 ORDER BY "rooms"."id" ASC LIMIT $2  [["name", "private_2_5"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" ASC  [["room_id", 9]]

  def set_user
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]