app/models/room.rb

  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
    users.each do |user|
      Participant.create(user_id: user.id, room_id: single_room.id)
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_2_5"], ["is_private", true], ["created_at", "2022-08-31 13:43:03.212471"], ["updated_at", "2022-08-31 13:43:03.212471"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["room_id", 9], ["created_at", "2022-08-31 13:43:03.234206"], ["updated_at", "2022-08-31 13:43:03.234206"]]

  def participant?(room, user)
    room.participants.where(user: user).exists?
    Participant.where(user_id: user.id, room_id: room.id).exists?
---
SELECT 1 AS one FROM "participants" WHERE "participants"."room_id" = $1 AND "participants"."user_id" = $2 LIMIT $3  [["room_id", 2], ["user_id", 12], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT 1 AS one FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."room_id" = $2 LIMIT $3  [["user_id", 12], ["room_id", 2], ["LIMIT", 1]]